#ifndef _MFRC522_H_
#define _MFRC522_H_



#include "USART.h"
#include "stm32f10x.h"
#include "MFRC522reg.h"


class MFRC522
{
//public:
//	volatile static u32 _it_cnt;      //SysTick interrupt counter
public:		
	/******************************************************************************
 *@brief：构造函数
 *@param：无
 *@retval：无
 ******************************************************************************/




	MFRC522();






/******************************************************************************
 *@brief：初始化RC522
 *@param：无
 *@retval：无
 ******************************************************************************/
 
 
 
 
 
	void init();//初始化
	
	
	
	
	
	/******************************************************************************
 *@brief：寻卡
 *@param：无
 *@retval：有卡，返回true，无卡，返回false
 ******************************************************************************/
 
 
	bool isCard();
	
	
	/******************************************************************************
 *@brief：寻卡，读取卡类型号
 *@param：reqMode--寻卡方式，
 *        TagType--返回卡片类型
 *                    0x4400 = Mifare_UltraLight
 *                    0x0400 = Mifare_One(S50)
 *                    0x0200 = Mifare_One(S70)
 *                    0x0800 = Mifare_Pro(X)
 *                    0x4403 = Mifare_DESFire
 *@retval：成功返回MI_OK
 ******************************************************************************/
 
 
	unsigned char MFRC522Request(unsigned char reqMode, unsigned char *TagType);
	

/******************************************************************************
 *@brief：向MFRC522的某一寄存器写一个字节数据
 *					第七位作为控制读写，1为读，0为写
 *					第六位保留
 *					0-5位为寄存器的值
 *@param：addr--寄存器地址；val--要写入的值
 *@retval：无
 ******************************************************************************/

	void writeMFRC522(unsigned char addr, unsigned char val);//写

/******************************************************************************
 *@brief：从MFRC522的某一寄存器读一个字节数据
 *					第七位作为控制读写，1为读，0为写
 *					第六位保留
 *					0-5位为寄存器的值
 *@param：addr--寄存器地址
 *@retval：返回读取到的一个字节数据
 ******************************************************************************/
	
	unsigned char readMFRC522(unsigned char addr);//读
	
/******************************************************************************
*@brief：返回卡的序列号 4字节
*@param：无
*@retval：成功返回ture 失败返回false
 ******************************************************************************/
 
	bool readCardSerial();
	
/******************************************************************************
 *@brief：防冲突检测，读取选中卡片的卡序列号
 *@param：serNum--返回4字节卡序列号,第5字节为校验字节
 *@retval：成功返回MI_OK
 ******************************************************************************/
	
	unsigned char anticoll(unsigned char *serNum);
	

/******************************************************************************
 *@brief：通过RC522和ISO14443卡通讯
 *@param：Command[IN]:RC522命令字
 *          pInData[IN]:通过RC522发送到卡片的数据
 *          InLenByte[IN]:发送数据的字节长度
 *          pOutData[OUT]:接收到的卡片返回数据
 *          *pOutLenBit[OUT]:返回数据的位长度
 *@retval：成功返回MI_OK
 ******************************************************************************/

	unsigned char MFRC522ToCard(unsigned char command, unsigned char *sendData, unsigned char sendLen, unsigned char *backData, unsigned int *backLen);
	
/******************************************************************************
 *@brief：清RC522寄存器位
 *@param：reg--寄存器地址;mask--清位值
 *@retval：无
 ******************************************************************************/

	void clearBitMask(unsigned char reg, unsigned char mask);

/******************************************************************************
 *@brief：置位RC522寄存器
 *@param：reg--寄存器地址;mask--置位值
 *@retval：无
 ******************************************************************************/
	
	void setBitMask(unsigned char reg, unsigned char mask);

/******************************************************************************
 *@brief：软件复位RC522
 *@param：无
*@retval：无
 ******************************************************************************/
	
	void reset();//重启MFRC522
	
/******************************************************************************
 *@brief：开启天线,每次启动或关闭天险发射之间应至少有1ms的间隔
 *@param：无
 *@retval：无
 ******************************************************************************/
	
	void antennaOn(void);//打开天线
	
/******************************************************************************
 *@brief：关闭天线,每次启动或关闭天险发射之间应至少有1ms的间隔
 *@param：无
 *@retval：无
 ******************************************************************************/
	
	void antennaOff(void);//关闭天线
	

	
	/******************************************************************************
 *@brief：命令卡片进入休眠状态
 *@param：无
 *@retval：无
 ******************************************************************************/
 
	void halt();//让卡休眠
	
/******************************************************************************
 *@brief：选择性Halt
 *@brief：命令卡片进入休眠状态
 *@param：无
 *@retval：无
 ******************************************************************************/
	
	void haltselect(unsigned char* str);
	
	/******************************************************************************
 *@brief：选卡，读取卡存储器容量
 *@param：serNum--传入卡序列号
 *@retval：成功返回卡容量
 ******************************************************************************/
	
	unsigned char selectTag(unsigned char *serNum);//选择卡片
	
/******************************************************************************
 *@brief：验证卡片密码
 *@param：authMode--密码验证模式
 *                     0x60 = 验证A密钥
 *                     0x61 = 验证B密钥
 *           BlockAddr--块地址
 *           Sectorkey--扇区密码
 *           serNum--卡片序列号，4字节
 *@retval：成功返回MI_OK
 ******************************************************************************/
	
	unsigned char auth(unsigned char authMode, unsigned char BlockAddr, unsigned char *Sectorkey, unsigned char *serNum);//认证
	
/******************************************************************************
 *@brief：用MF522计算CRC
 *@param：pIndata--要读数CRC的数据，len--数据长度，pOutData--计算的CRC结果
 *@retval：无
 ******************************************************************************/
	
	void calculateCRC(unsigned char *pIndata, unsigned char len, unsigned char *pOutData);//CRC
	
/******************************************************************************
 *@brief：读块数据
 *@param：blockAddr--块地址;recvData--读出的块数据
 *@retval：成功返回MI_OK
 ******************************************************************************/
 
	unsigned char read(unsigned char blockAddr, unsigned char *recvData);//读块数据
	
/******************************************************************************
 *@brief：写块数据
 *@param：blockAddr--块地址;writeData--向块写16字节数据
 *@retval：成功返回MI_OK
 ******************************************************************************/
 
 
	unsigned char write(unsigned char blockAddr, unsigned char *writeData);//写块数据
	




	unsigned char serNum[5];      // 4字节卡序列号，第5字节为校验字节
	unsigned char ReadStr[16];		//	每次读取16个字节
};

extern MFRC522 mfrc522;

#endif





